## Staging: idp
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                                  NAME                                  |
|----------|------------------------------------------------------------------------|
| recreate | `module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this`    |
| update   | `module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render will be updated in-place
  ~ resource "aws_codebuild_project" "ecs_render" {
      ~ build_timeout          = 5 -> 10
        id                     = "arn:aws:codebuild:ca-central-1:687401027353:project/ECS-Render-idp_user_portal"
        name                   = "ECS-Render-idp_user_portal"
        tags                   = {}
        # (14 unchanged attributes hidden)

      ~ source {
          ~ buildspec           = jsonencode(
              ~ {
                  ~ phases    = {
                      ~ build      = {
                          ~ commands   = [
                              ~ "aws ecr get-login-password --region ca-central-1 | docker login --username AWS --password-stdin 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal" -> "export GIT_TAG=$(git tag --points-at $GIT_COMMIT_ID)",
                              ~ "docker build -t base ." -> "aws ecr get-login-password --region ca-central-1 | docker login --username AWS --password-stdin 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal",
                              ~ "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest" -> "docker build -t base  .",
                              ~ "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest" -> "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              ~ "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID" -> "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:latest",
                              ~ "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID" -> "docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                              ~ "export GIT_TAG=$(git tag --points-at $GIT_COMMIT_ID)" -> "docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_COMMIT_ID",
                                "if [[ -n \"$GIT_TAG\" ]]; then docker tag base 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG && docker push 687401027353.dkr.ecr.ca-central-1.amazonaws.com/idp/user_portal:$GIT_TAG; fi",
                            ]
                            # (2 unchanged attributes hidden)
                        }
                        # (1 unchanged attribute hidden)
                    }
                    # (3 unchanged attributes hidden)
                }
            )
            # (5 unchanged attributes hidden)
        }

        # (5 unchanged blocks hidden)
    }

  # module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this must be replaced
-/+ resource "aws_codepipeline_webhook" "this" {
      ~ arn             = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
      ~ id              = "arn:aws:codepipeline:ca-central-1:687401027353:webhook:github-webhook-idp_user_portal" -> (known after apply)
        name            = "github-webhook-idp_user_portal"
      - tags            = {} -> null
      ~ url             = "https://ca-central-1.webhooks.aws/trigger?t=eyJlbmNyeXB0ZWREYXRhIjoiSVlNNXFzOG5idERkTHY5ZXRrWjJxbmx0cmZac0tnN0RzY0JMVUpzVnY5VzFrbnJUVXZNRUV6OG5CZlQ1U1hmM01IZlZoTW14YlIxU2kyNS8weHpnS0tLYVQ2VDZsTkpORkNqeVdHZlovbkVmTHRIL3hnNmhTaEZWL2NNczAwY2RxWnpCeTk0YmtuS2xpejZIeDFvcHIvOU5BNk9FclVuL01BRS9mMmdrSk5yY3R3PT0iLCJpdlBhcmFtZXRlclNwZWMiOiJQdVNmd0VUd1NKSTJaMkpaIiwibWF0ZXJpYWxTZXRTZXJpYWwiOjF9&v=1" -> (known after apply)
        # (5 unchanged attributes hidden)

      ~ authentication_configuration {
          ~ secret_token     = (sensitive value) # forces replacement
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

Warning: Deprecated attribute

  on .terraform/modules/idp_database/rds/locals.tf line 14, in locals:
  14:   region        = data.aws_region.current.name

The attribute "name" is deprecated. Refer to the provider documentation for
details.

(and 2 more similar warnings elsewhere)

Warning: Argument is deprecated

  with module.idp_ecs.aws_service_discovery_service.this,
  on .terraform/modules/idp_ecs/ecs/service_discovery.tf line 15, in resource "aws_service_discovery_service" "this":
  15:     failure_threshold = 1

failure_threshold is deprecated. The argument is no longer supported by AWS
and the value is always set to 1. The attribute will be removed in a future
major version.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.idp_protocol_version"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener_rule.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.idp"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.user_portal[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.ecs_xray"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.user_portal_ssm"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.idp_user_portal"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_user.idp_send_email"]
WARN - plan.json - main - Missing Common Tags: ["aws_shield_protection.idp"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codebuild_project.ecs_render"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_app.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codedeploy_deployment_group.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codepipeline_webhook.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_codestarconnections_connection.this"]
WARN - plan.json - main - Missing Common Tags: ["module.user_portal_code_pipeline[0].aws_iam_role.this"]
WARN - plan.json...
```

</details>
